app/controllers/mercs_controller.rb

SELECT "mercs".* FROM "mercs"
---
  def index
    @mercs = Merc.all

INSERT INTO "mercs" ("TipoMerc_id", "merc_nome", "qtde", "preco", "TipoNeg_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["TipoMerc_id", 1], ["merc_nome", "Salgadinho"], ["qtde", 10], ["preco", 1.5], ["TipoNeg_id", 1], ["created_at", 2017-02-05 16:35:54 UTC], ["updated_at", 2017-02-05 16:35:54 UTC]]
---
  def create
    @merc = Merc.new(merc_params)

    respond_to do |format|
      if @merc.save

UPDATE "mercs" SET "merc_nome" = ?, "qtde" = ?, "preco" = ?, "updated_at" = ? WHERE "mercs"."id" = ?  [["merc_nome", "Arroz"], ["qtde", 1], ["preco", 1.0], ["updated_at", 2017-02-05 18:41:39 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @merc.update(merc_params)

DELETE FROM "mercs" WHERE "mercs"."id" = ?  [["id", 5]]
---
  def destroy
    @merc.destroy

SELECT  "tipo_mercs".* FROM "tipo_mercs" WHERE "tipo_mercs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_merc
      @merc = Merc.find(params[:id])