app/controllers/tipo_mercs_controller.rb

  def index
    @tipo_mercs = TipoMerc.all
---
SELECT "tipo_mercs".* FROM "tipo_mercs"

  def create
    @tipo_merc = TipoMerc.new(tipo_merc_params)

    respond_to do |format|
      if @tipo_merc.save
---
INSERT INTO "tipo_mercs" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "Alimento"], ["created_at", 2017-02-05 16:34:33 UTC], ["updated_at", 2017-02-05 16:34:33 UTC]]

  def update
    respond_to do |format|
      if @tipo_merc.update(tipo_merc_params)
---
UPDATE "tipo_mercs" SET "descricao" = ?, "updated_at" = ? WHERE "tipo_mercs"."id" = ?  [["descricao", "H"], ["updated_at", 2017-02-05 21:08:48 UTC], ["id", 1]]

  def destroy
    @tipo_merc.destroy
---
DELETE FROM "tipo_mercs" WHERE "tipo_mercs"."id" = ?  [["id", 1]]

    def set_tipo_merc
      @tipo_merc = TipoMerc.find(params[:id])
---
SELECT  "tipo_mercs".* FROM "tipo_mercs" WHERE "tipo_mercs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]