app/controllers/tipo_negs_controller.rb

SELECT "tipo_negs".* FROM "tipo_negs"
---
  def index
    @tipo_negs = TipoNeg.all

INSERT INTO "tipo_negs" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "Compra"], ["created_at", 2017-02-05 16:35:05 UTC], ["updated_at", 2017-02-05 16:35:05 UTC]]
---
  def create
    @tipo_neg = TipoNeg.new(tipo_neg_params)

    respond_to do |format|
      if @tipo_neg.save

DELETE FROM "tipo_negs" WHERE "tipo_negs"."id" = ?  [["id", 2]]
---
  def destroy
    @tipo_neg.destroy

SELECT  "tipo_negs".* FROM "tipo_negs" WHERE "tipo_negs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_tipo_neg
      @tipo_neg = TipoNeg.find(params[:id])